; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 236959 2 1 2 6 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph0 - mode
	thermograph1 - mode
	GroundStation1 - direction
	Star3 - direction
	Star5 - direction
	Star0 - direction
	Star2 - direction
	Star4 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(pointing satellite1 Star2)
	(have_image Phenomenon6 thermograph0)
	(have_image Planet7 thermograph0)
	(have_image Star8 thermograph1)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 4
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
3. (turn_to satellite0 star8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star8)
   goals met: 0 of 4
4. (turn_to satellite1 star2 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star2)
   goals met: 1 of 4
5. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 1 of 4
6. (turn_to satellite1 star8 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star8)
   goals met: 0 of 4
7. (take_image satellite1 star8 instrument1 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 1 of 4
8. (turn_to satellite1 star2 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star2)
   goals met: 2 of 4
9. (turn_to satellite1 planet7 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet7)
   goals met: 1 of 4
10. (take_image satellite1 planet7 instrument1 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 2 of 4
11. (turn_to satellite1 star2 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star2)
   goals met: 3 of 4
12. (turn_to satellite1 phenomenon6 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon6)
   goals met: 2 of 4
13. (take_image satellite1 phenomenon6 instrument1 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   goals met: 3 of 4
14. (turn_to satellite1 star2 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star2)
   goals met: 4 of 4
